<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

use Illuminate\Support\Facades\DB;
class CitySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $data = [
            'جهة الشرق' => ['وجدة', 'تاوريرت', 'بركان', 'الناظور', 'جرسيف', 'الدريوش', 'جرادة', 'فكيك'],
            'جهة طنجة تطوان الحسيمة' => ['طنجة', 'تطوان', 'الحسيمة', 'شفشاون', 'وزان', 'العرائش', 'الفنيدق'],
            'جهة فاس مكناس' => ['فاس', 'مكناس', 'تازة', 'صفرو', 'بولمان', 'تاونات', 'إفران', 'الحاجب'],
            'جهة الرباط سلا القنيطرة' => ['الالرباط', 'سلا', 'القنيطرة', 'تمارة', 'الخميسات', 'سيدي قاسم', 'سيدي سليمان'],
            'جهة بني ملال خنيفرة' => ['بني ملال', 'خنيفرة', 'أزيلال', 'الفقيه بن صالح', 'خريبكة'],
            'جهة الدار البيضاء سطات' => ['الدار البيضاء', 'المحمدية', 'سطات', 'الجديدة', 'برشيد', 'بنسليمان', 'سيدي بنور'],
            'جهة مراكش آسفي' => ['مراكش', 'آسفي', 'الصويرة', 'قلعة السراغنة', 'الحوز', 'شيشاوة', 'اليوسفية'],
            'جهة درعة تافيلالت' => ['الرشيدية', 'ورزازات', 'ميدلت', 'تنغير', 'زاكورة'],
            'جهة سوس ماسة' => ['أكادير', 'إنزكان', 'أيت ملول', 'تارودانت', 'تيزنيت', 'طاطا', 'اشتوكة أيت باها'],
            'جهة كلميم واد نون' => ['كلميم', 'سيدي إفني', 'طانطان', 'آسا الزاك'],
            'جهة العيون الساقية الحمراء' => ['العيون', 'بوجدور', 'السمارة', 'طرفاية'],
            'جهة الداخلة وادي الذهب' => ['الداخلة', 'أوسرد'],
        ];
        foreach($data as $regionName =>$cities ){
            $regionId=DB::table("regions")->where("name",$regionName)->value("id");

            if($regionId){
                $citiesToInsert=array_map(function($cityName) use  ($regionId){
                    return [
                        'name' => $cityName,
                        'region_id' =>$regionId,
                        'created_at' => now(),
                        'updated_at' => now(),
                    ];
                },$cities);
            }
            DB::table('cities')->insert($citiesToInsert);
        };
    }
}
